# GetLabelFor Method (BuiltInParameter)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LabelUtils..::..GetLabelFor Method (BuiltInParameter)
LabelUtils Class See Also
---
Gets the user-visible name for a BuiltInParameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static string GetLabelFor(
	BuiltInParameter builtInParam
)
```

Visual Basic
---
```text
Public Shared Function GetLabelFor ( _
	builtInParam As BuiltInParameter _
) As String
```

Visual C++
---
```text
public:
static String^ GetLabelFor(
	BuiltInParameter builtInParam
)
```

# ### Parameters
builtInParam
    Type: Autodesk.Revit.DB..::..BuiltInParameter The BuiltInParameter to get the user-visible name.
# Remarks
The name is obtained in the current Revit language.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the BuiltInParameter cannot be found. |

# See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace